GopalSaraf/Practicals/PSDL/include/proc/pic18f4320.inc
// Register: CVRCON
#define CVRCON CVRCON
CVRCON                                   equ 0FB5h
// bitfield definitions
CVRCON_CVR_POSN                          equ 0000h
CVRCON_CVR_POSITION                      equ 0000h
CVRCON_CVR_SIZE                          equ 0004h
CVRCON_CVR_LENGTH                        equ 0004h
CVRCON_CVR_MASK                          equ 000Fh
CVRCON_CVRR_POSN                         equ 0005h
CVRCON_CVRR_POSITION                     equ 0005h
CVRCON_CVRR_SIZE                         equ 0001h
CVRCON_CVRR_LENGTH                       equ 0001h
CVRCON_CVRR_MASK                         equ 0020h
CVRCON_CVROE_POSN                        equ 0006h
CVRCON_CVROE_POSITION                    equ 0006h
CVRCON_CVROE_SIZE                        equ 0001h
CVRCON_CVROE_LENGTH                      equ 0001h
CVRCON_CVROE_MASK                        equ 0040h
CVRCON_CVREN_POSN                        equ 0007h
CVRCON_CVREN_POSITION                    equ 0007h
CVRCON_CVREN_SIZE                        equ 0001h
CVRCON_CVREN_LENGTH                      equ 0001h
CVRCON_CVREN_MASK                        equ 0080h
CVRCON_CVR0_POSN                         equ 0000h
CVRCON_CVR0_POSITION                     equ 0000h
CVRCON_CVR0_SIZE                         equ 0001h
CVRCON_CVR0_LENGTH                       equ 0001h
CVRCON_CVR0_MASK                         equ 0001h
CVRCON_CVR1_POSN                         equ 0001h
CVRCON_CVR1_POSITION                     equ 0001h
CVRCON_CVR1_SIZE                         equ 0001h
CVRCON_CVR1_LENGTH                       equ 0001h
CVRCON_CVR1_MASK                         equ 0002h
CVRCON_CVR2_POSN                         equ 0002h
CVRCON_CVR2_POSITION                     equ 0002h
CVRCON_CVR2_SIZE                         equ 0001h
CVRCON_CVR2_LENGTH                       equ 0001h
CVRCON_CVR2_MASK                         equ 0004h
CVRCON_CVR3_POSN                         equ 0003h
CVRCON_CVR3_POSITION                     equ 0003h
CVRCON_CVR3_SIZE                         equ 0001h
CVRCON_CVR3_LENGTH                       equ 0001h
CVRCON_CVR3_MASK                         equ 0008h
CVRCON_CVROEN_POSN                       equ 0006h
CVRCON_CVROEN_POSITION                   equ 0006h
CVRCON_CVROEN_SIZE                       equ 0001h
CVRCON_CVROEN_LENGTH                     equ 0001h
CVRCON_CVROEN_MASK                       equ 0040h

// Register: ECCPAS
#define ECCPAS ECCPAS
ECCPAS                                   equ 0FB6h
// bitfield definitions
ECCPAS_PSSBD_POSN                        equ 0000h
ECCPAS_PSSBD_POSITION                    equ 0000h
ECCPAS_PSSBD_SIZE                        equ 0002h
ECCPAS_PSSBD_LENGTH                      equ 0002h
ECCPAS_PSSBD_MASK                        equ 0003h
ECCPAS_PSSAC_POSN                        equ 0002h
ECCPAS_PSSAC_POSITION                    equ 0002h
ECCPAS_PSSAC_SIZE                        equ 0002h
ECCPAS_PSSAC_LENGTH                      equ 0002h
ECCPAS_PSSAC_MASK                        equ 000Ch
ECCPAS_ECCPAS_POSN                       equ 0004h
ECCPAS_ECCPAS_POSITION                   equ 0004h
ECCPAS_ECCPAS_SIZE                       equ 0003h
ECCPAS_ECCPAS_LENGTH                     equ 0003h
ECCPAS_ECCPAS_MASK                       equ 0070h
ECCPAS_ECCPASE_POSN                      equ 0007h
ECCPAS_ECCPASE_POSITION                  equ 0007h
ECCPAS_ECCPASE_SIZE                      equ 0001h
ECCPAS_ECCPASE_LENGTH                    equ 0001h
ECCPAS_ECCPASE_MASK                      equ 0080h
ECCPAS_PSSBD0_POSN                       equ 0000h
ECCPAS_PSSBD0_POSITION                   equ 0000h
ECCPAS_PSSBD0_SIZE                       equ 0001h
ECCPAS_PSSBD0_LENGTH                     equ 0001h
ECCPAS_PSSBD0_MASK                       equ 0001h
ECCPAS_PSSBD1_POSN                       equ 0001h
ECCPAS_PSSBD1_POSITION                   equ 0001h
ECCPAS_PSSBD1_SIZE                       equ 0001h
ECCPAS_PSSBD1_LENGTH                     equ 0001h
ECCPAS_PSSBD1_MASK                       equ 0002h
ECCPAS_PSSAC0_POSN                       equ 0002h
ECCPAS_PSSAC0_POSITION                   equ 0002h
ECCPAS_PSSAC0_SIZE                       equ 0001h
ECCPAS_PSSAC0_LENGTH                     equ 0001h
ECCPAS_PSSAC0_MASK                       equ 0004h
ECCPAS_PSSAC1_POSN                       equ 0003h
ECCPAS_PSSAC1_POSITION                   equ 0003h
ECCPAS_PSSAC1_SIZE                       equ 0001h
ECCPAS_PSSAC1_LENGTH                     equ 0001h
ECCPAS_PSSAC1_MASK                       equ 0008h
ECCPAS_ECCPAS0_POSN                      equ 0004h
ECCPAS_ECCPAS0_POSITION                  equ 0004h
ECCPAS_ECCPAS0_SIZE                      equ 0001h
ECCPAS_ECCPAS0_LENGTH                    equ 0001h
ECCPAS_ECCPAS0_MASK                      equ 0010h
ECCPAS_ECCPAS1_POSN                      equ 0005h
ECCPAS_ECCPAS1_POSITION                  equ 0005h
ECCPAS_ECCPAS1_SIZE                      equ 0001h
ECCPAS_ECCPAS1_LENGTH                    equ 0001h
ECCPAS_ECCPAS1_MASK                      equ 0020h
ECCPAS_ECCPAS2_POSN                      equ 0006h
ECCPAS_ECCPAS2_POSITION                  equ 0006h
ECCPAS_ECCPAS2_SIZE                      equ 0001h
ECCPAS_ECCPAS2_LENGTH                    equ 0001h
ECCPAS_ECCPAS2_MASK                      equ 0040h

// Register: PWM1CON
#define PWM1CON PWM1CON
PWM1CON                                  equ 0FB7h
// bitfield definitions
PWM1CON_PDC_POSN                         equ 0000h
PWM1CON_PDC_POSITION                     equ 0000h
PWM1CON_PDC_SIZE                         equ 0007h
PWM1CON_PDC_LENGTH                       equ 0007h
PWM1CON_PDC_MASK                         equ 007Fh
PWM1CON_PRSEN_POSN                       equ 0007h
PWM1CON_PRSEN_POSITION                   equ 0007h
PWM1CON_PRSEN_SIZE                       equ 0001h
PWM1CON_PRSEN_LENGTH                     equ 0001h
PWM1CON_PRSEN_MASK                       equ 0080h
PWM1CON_PDC0_POSN                        equ 0000h
PWM1CON_PDC0_POSITION                    equ 0000h
PWM1CON_PDC0_SIZE                        equ 0001h
PWM1CON_PDC0_LENGTH                      equ 0001h
PWM1CON_PDC0_MASK                        equ 0001h
PWM1CON_PDC1_POSN                        equ 0001h
PWM1CON_PDC1_POSITION                    equ 0001h
PWM1CON_PDC1_SIZE                        equ 0001h
PWM1CON_PDC1_LENGTH                      equ 0001h
PWM1CON_PDC1_MASK                        equ 0002h
PWM1CON_PDC2_POSN                        equ 0002h
PWM1CON_PDC2_POSITION                    equ 0002h
PWM1CON_PDC2_SIZE                        equ 0001h
PWM1CON_PDC2_LENGTH                      equ 0001h
PWM1CON_PDC2_MASK                        equ 0004h
PWM1CON_PDC3_POSN                        equ 0003h
PWM1CON_PDC3_POSITION                    equ 0003h
PWM1CON_PDC3_SIZE                        equ 0001h
PWM1CON_PDC3_LENGTH                      equ 0001h
PWM1CON_PDC3_MASK                        equ 0008h
PWM1CON_PDC4_POSN                        equ 0004h
PWM1CON_PDC4_POSITION                    equ 0004h
PWM1CON_PDC4_SIZE                        equ 0001h
PWM1CON_PDC4_LENGTH                      equ 0001h
PWM1CON_PDC4_MASK                        equ 0010h
PWM1CON_PDC5_POSN                        equ 0005h
PWM1CON_PDC5_POSITION                    equ 0005h
PWM1CON_PDC5_SIZE                        equ 0001h
PWM1CON_PDC5_LENGTH                      equ 0001h
PWM1CON_PDC5_MASK                        equ 0020h
PWM1CON_PDC6_POSN                        equ 0006h
PWM1CON_PDC6_POSITION                    equ 0006h
PWM1CON_PDC6_SIZE                        equ 0001h
PWM1CON_PDC6_LENGTH                      equ 0001h
PWM1CON_PDC6_MASK                        equ 0040h

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 0FBAh
// bitfield definitions
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h
CCP2CON_CCP2Y_POSN                       equ 0004h
CCP2CON_CCP2Y_POSITION                   equ 0004h
CCP2CON_CCP2Y_SIZE                       equ 0001h
CCP2CON_CCP2Y_LENGTH                     equ 0001h
CCP2CON_CCP2Y_MASK                       equ 0010h
CCP2CON_CCP2X_POSN                       equ 0005h
CCP2CON_CCP2X_POSITION                   equ 0005h
CCP2CON_CCP2X_SIZE                       equ 0001h
CCP2CON_CCP2X_LENGTH                     equ 0001h
CCP2CON_CCP2X_MASK                       equ 0020h
CCP2CON_DCP2Y_POSN                       equ 0004h
CCP2CON_DCP2Y_POSITION                   equ 0004h
CCP2CON_DCP2Y_SIZE                       equ 0001h
CCP2CON_DCP2Y_LENGTH                     equ 0001h
CCP2CON_DCP2Y_MASK                       equ 0010h
CCP2CON_DCP2X_POSN                       equ 0005h
CCP2CON_DCP2X_POSITION                   equ 0005h
CCP2CON_DCP2X_SIZE                       equ 0001h
CCP2CON_DCP2X_LENGTH                     equ 0001h
CCP2CON_DCP2X_MASK                       equ 0020h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 0FBBh

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0FBBh

